testing/log-images/Normal Load Testing (16 VUs)/k6 summary.log

          /\      |‾‾| /‾‾/   /‾‾/
     /\  /  \     |  |/  /   /  /
    /  \/    \    |     (   /   ‾‾\
   /          \   |  |\  \ |  (‾)  |
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: load-testing.js
     output: Prometheus remote write (http://localhost:9090/api/v1/write)

  scenarios: (100.00%) 1 scenario, 16 max VUs, 20m30s max duration (incl. graceful stop):
           * default: Up to 16 looping VUs for 20m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)

     ✗ status was 200
      ↳  91% — ✓ 493 / ✗ 43

     checks.........................: 91.97% ✓ 493      ✗ 43
     data_received..................: 102 kB 84 B/s
     data_sent......................: 708 kB 584 B/s
     http_req_blocked...............: avg=183.79ms min=6.03µs  med=214.62ms max=249.32ms p(90)=237.97ms p(95)=238.36ms
     http_req_connecting............: avg=183.63ms min=0s      med=214.43ms max=249.16ms p(90)=237.78ms p(95)=238.2ms
     http_req_duration..............: avg=12.05s   min=34.28ms med=12.21s   max=46.68s   p(90)=23.66s   p(95)=30.95s
       { expected_response:true }...: avg=12.87s   min=1.91s   med=12.58s   max=46.68s   p(90)=24.72s   p(95)=31.16s
     http_req_failed................: 8.02%  ✓ 43       ✗ 493
     http_req_receiving.............: avg=206.32ms min=0s      med=214.45ms max=242.18ms p(90)=237.4ms  p(95)=237.8ms
     http_req_sending...............: avg=160.31µs min=30.36µs med=143.26µs max=5.8ms    p(90)=195.26µs p(95)=228.59µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s
     http_req_waiting...............: avg=11.84s   min=34.23ms med=11.98s   max=46.47s   p(90)=23.44s   p(95)=30.74s
     http_reqs......................: 536    0.442013/s
     iteration_duration.............: avg=27.23s   min=15.03s  med=27.37s   max=1m1s     p(90)=38.87s   p(95)=46.17s
     iterations.....................: 536    0.442013/s
     vus............................: 1      min=0      max=16
     vus_max........................: 16     min=16     max=16


running (20m12.6s), 00/16 VUs, 536 complete and 0 interrupted iterations